tiborsimon/embedded-tdd-headers/pic/8bit/pic16lf1768_tdd.h
#define RA4PPS                        2765
#define RA5PPS                        2766
#define RB4PPS                        2767
#define RB5PPS                        2768
#define RB6PPS                        2769
#define RB7PPS                        2770
#define RC0PPS                        2771
#define RC1PPS                        2772
#define RC2PPS                        2773
#define RC3PPS                        2774
#define RC4PPS                        2775
#define RC5PPS                        2776
#define RC6PPS                        2777
#define RC7PPS                        2778
#define CLCDATA                       2779
#define MCLC1OUT                      2780
#define MCLC2OUT                      2781
#define MCLC3OUT                      2782
#define CLC1CON                       2783
#define CLC1CON_MODE                  2784
#define LC1MODE0                      2785
#define LC1MODE                       2786
#define CLC1CON_MODE0                 2787
#define LC1MODE1                      2788
#define CLC1CON_MODE1                 2789
#define LC1MODE2                      2790
#define CLC1CON_MODE2                 2791
#define LC1INTN                       2792
#define CLC1CON_INTN                  2793
#define LC1INTP                       2794
#define CLC1CON_INTP                  2795
#define LC1OUT                        2796
#define CLC1CON_OUT                   2797
#define LC1EN                         2798
#define CLC1CON_EN                    2799
#define CLC1POL                       2800
#define LC1G1POL                      2801
#define CLC1POL_G1POL                 2802
#define CLC1POL_G2POL                 2803
#define LC1G2POL                      2804
#define LC1G3POL                      2805
#define CLC1POL_G3POL                 2806
#define LC1G4POL                      2807
#define CLC1POL_G4POL                 2808
#define CLC1POL_POL                   2809
#define LC1POL                        2810
#define CLC1SEL0                      2811
#define CLC1SEL0_D1S0                 2812
#define LC1D1S                        2813
#define LC1D1S0                       2814
#define CLC1SEL0_D1S                  2815
#define CLC1SEL0_D1S1                 2816
#define LC1D1S1                       2817
#define CLC1SEL0_D1S2                 2818
#define LC1D1S2                       2819
#define CLC1SEL0_D1S3                 2820
#define LC1D1S3                       2821
#define CLC1SEL0_D1S4                 2822
#define LC1D1S4                       2823
#define CLC1SEL1                      2824
#define CLC1SEL1_D2S0                 2825
#define CLC1SEL1_D2S                  2826
#define LC1D2S                        2827
#define LC1D2S0                       2828
#define CLC1SEL1_D2S1                 2829
#define LC1D2S1                       2830
#define LC1D2S2                       2831
#define CLC1SEL1_D2S2                 2832
#define LC1D2S3                       2833
#define CLC1SEL1_D2S3                 2834
#define LC1D2S4                       2835
#define CLC1SEL1_D2S4                 2836
#define CLC1SEL2                      2837
#define LC1D3S0                       2838
#define CLC1SEL2_D3S                  2839
#define LC1D3S                        2840
#define CLC1SEL2_D3S0                 2841
#define LC1D3S1                       2842
#define CLC1SEL2_D3S1                 2843
#define LC1D3S2                       2844
#define CLC1SEL2_D3S2                 2845
#define LC1D3S3                       2846
#define CLC1SEL2_D3S3                 2847
#define LC1D3S4                       2848
#define CLC1SEL2_D3S4                 2849
#define CLC1SEL3                      2850
#define CLC1SEL3_D4S                  2851
#define LC1D4S                        2852
#define LC1D4S0                       2853
#define CLC1SEL3_D4S0                 2854
#define CLC1SEL3_D4S1                 2855
#define LC1D4S1                       2856
#define LC1D4S2                       2857
#define CLC1SEL3_D4S2                 2858
#define LC1D4S3                       2859
#define CLC1SEL3_D4S3                 2860
#define LC1D4S4                       2861
#define CLC1SEL3_D4S4                 2862
#define CLC1GLS0                      2863
#define CLC1GLS0_D1N                  2864
#define LC1G1D1N                      2865
#define CLC1GLS0_D1T                  2866
#define LC1G1D1T                      2867
#define LC1G1D2N                      2868
#define CLC1GLS0_D2N                  2869
#define LC1G1D2T                      2870
#define CLC1GLS0_D2T                  2871
#define CLC1GLS0_D3N                  2872
#define LC1G1D3N                      2873
#define CLC1GLS0_D3T                  2874
#define LC1G1D3T                      2875
#define CLC1GLS0_D4N                  2876
#define LC1G1D4N                      2877
#define CLC1GLS0_D4T                  2878
#define LC1G1D4T                      2879
#define CLC1GLS1                      2880
#define CLC1GLS1_D1N                  2881
#define LC1G2D1N                      2882
#define LC1G2D1T                      2883
#define CLC1GLS1_D1T                  2884
#define CLC1GLS1_D2N                  2885
#define LC1G2D2N                      2886
#define LC1G2D2T                      2887
#define CLC1GLS1_D2T                  2888
#define CLC1GLS1_D3N                  2889
#define LC1G2D3N                      2890
#define LC1G2D3T                      2891
#define CLC1GLS1_D3T                  2892
#define CLC1GLS1_D4N                  2893
#define LC1G2D4N                      2894
#define LC1G2D4T                      2895
#define CLC1GLS1_D4T                  2896
#define CLC1GLS2                      2897
#define CLC1GLS2_D1N                  2898
#define LC1G3D1N                      2899
#define LC1G3D1T                      2900
#define CLC1GLS2_D1T                  2901
#define LC1G3D2N                      2902
#define CLC1GLS2_D2N                  2903
#define LC1G3D2T                      2904
#define CLC1GLS2_D2T                  2905
#define CLC1GLS2_D3N                  2906
#define LC1G3D3N                      2907
#define LC1G3D3T                      2908
#define CLC1GLS2_D3T                  2909
#define LC1G3D4N                      2910
#define CLC1GLS2_D4N                  2911
#define LC1G3D4T                      2912
#define CLC1GLS2_D4T                  2913
#define CLC1GLS3                      2914
#define LC1G4D1N                      2915
#define CLC1GLS3_G4D1N                2916
#define LC1G4D1T                      2917
#define CLC1GLS3_G4D1T                2918
#define CLC1GLS3_G4D2N                2919
#define LC1G4D2N                      2920
#define CLC1GLS3_G4D2T                2921
#define LC1G4D2T                      2922
#define LC1G4D3N                      2923
#define CLC1GLS3_G4D3N                2924
#define LC1G4D3T                      2925
#define CLC1GLS3_G4D3T                2926
#define CLC1GLS3_G4D4N                2927
#define LC1G4D4N                      2928
#define CLC1GLS3_G4D4T                2929
#define LC1G4D4T                      2930
#define CLC2CON                       2931
#define LC2MODE0                      2932
#define CLC2CON_MODE                  2933
#define LC2MODE                       2934
#define CLC2CON_MODE0                 2935
#define LC2MODE1                      2936
#define CLC2CON_MODE1                 2937
#define LC2MODE2                      2938
#define CLC2CON_MODE2                 2939
#define LC2INTN                       2940
#define CLC2CON_INTN                  2941
#define LC2INTP                       2942
#define CLC2CON_INTP                  2943
#define CLC2CON_OUT                   2944
#define LC2OUT                        2945
#define CLC2CON_EN                    2946
#define LC2EN                         2947
#define CLC2POL                       2948
#define LC2G1POL                      2949
#define CLC2POL_G1POL                 2950
#define LC2G2POL                      2951
#define CLC2POL_G2POL                 2952
#define LC2G3POL                      2953
#define CLC2POL_G3POL                 2954
#define LC2G4POL                      2955
#define CLC2POL_G4POL                 2956
#define CLC2POL_POL                   2957
#define LC2POL                        2958
#define CLC2SEL0                      2959
#define CLC2SEL0_D1S                  2960
#define LC2D1S0                       2961
#define CLC2SEL0_D1S0                 2962
#define LC2D1S                        2963
#define LC2D1S1                       2964
#define CLC2SEL0_D1S1                 2965
#define LC2D1S2                       2966
#define CLC2SEL0_D1S2                 2967
#define CLC2SEL0_D1S3                 2968
#define LC2D1S3                       2969
#define LC2D1S4                       2970
#define CLC2SEL0_D1S4                 2971
#define CLC2SEL1                      2972
#define LC2D2S0                       2973
#define CLC2SEL1_D2S0                 2974
#define LC2D2S                        2975
#define CLC2SEL1_D2S                  2976
#define LC2D2S1                       2977
#define CLC2SEL1_D2S1                 2978
#define LC2D2S2                       2979
#define CLC2SEL1_D2S2                 2980
#define LC2D2S3                       2981
#define CLC2SEL1_D2S3                 2982
#define LC2D2S4                       2983
#define CLC2SEL1_D2S4                 2984
#define CLC2SEL2                      2985
#define CLC2SEL2_D3S                  2986
#define LC2D3S0                       2987
#define CLC2SEL2_D3S0                 2988
#define LC2D3S                        2989
#define CLC2SEL2_D3S1                 2990
#define LC2D3S1                       2991
#define LC2D3S2                       2992
#define CLC2SEL2_D3S2                 2993
#define LC2D3S3                       2994
#define CLC2SEL2_D3S3                 2995
#define LC2D3S4                       2996
#define CLC2SEL2_D3S4                 2997
#define CLC2SEL3                      2998
#define LC2D4S                        2999
#define LC2D4S0                       3000
#define CLC2SEL3_D4S                  3001
#define CLC2SEL3_D4S0                 3002
#define LC2D4S1                       3003
#define CLC2SEL3_D4S1                 3004
#define LC2D4S2                       3005
#define CLC2SEL3_D4S2                 3006
#define CLC2SEL3_D4S3                 3007
#define LC2D4S3                       3008
#define LC2D4S4                       3009
#define CLC2SEL3_D4S4                 3010
#define CLC2GLS0                      3011
#define LC2G1D1N                      3012
#define CLC2GLS0_D1N                  3013
#define CLC2GLS0_D1T                  3014
#define LC2G1D1T                      3015
#define LC2G1D2N                      3016
#define CLC2GLS0_D2N                  3017
#define CLC2GLS0_D2T                  3018
#define LC2G1D2T                      3019
#define LC2G1D3N                      3020
#define CLC2GLS0_D3N                  3021
#define CLC2GLS0_D3T                  3022
#define LC2G1D3T                      3023
#define LC2G1D4N                      3024
#define CLC2GLS0_D4N                  3025
#define CLC2GLS0_D4T                  3026
#define LC2G1D4T                      3027
#define CLC2GLS1                      3028
#define CLC2GLS1_D1N                  3029
#define LC2G2D1N                      3030
#define CLC2GLS1_D1T                  3031
#define LC2G2D1T                      3032
#define CLC2GLS1_D2N                  3033
#define LC2G2D2N                      3034
#define CLC2GLS1_D2T                  3035
#define LC2G2D2T                      3036
#define LC2G2D3N                      3037
#define CLC2GLS1_D3N                  3038
#define LC2G2D3T                      3039
#define CLC2GLS1_D3T                  3040
#define LC2G2D4N                      3041
#define CLC2GLS1_D4N                  3042
#define LC2G2D4T                      3043
#define CLC2GLS1_D4T                  3044
#define CLC2GLS2                      3045
#define LC2G3D1N                      3046
#define CLC2GLS2_D1N                  3047
#define CLC2GLS2_D1T                  3048
#define LC2G3D1T                      3049
#define CLC2GLS2_D2N                  3050
#define LC2G3D2N                      3051
#define LC2G3D2T                      3052
#define CLC2GLS2_D2T                  3053
#define CLC2GLS2_D3N                  3054
#define LC2G3D3N                      3055
#define CLC2GLS2_D3T                  3056
#define LC2G3D3T                      3057
#define CLC2GLS2_D4N                  3058
#define LC2G3D4N                      3059
#define LC2G3D4T                      3060
#define CLC2GLS2_D4T                  3061
#define CLC2GLS3                      3062
#define LC2G4D1N                      3063
#define CLC2GLS3_G4D1N                3064
#define CLC2GLS3_G4D1T                3065
#define LC2G4D1T                      3066
#define CLC2GLS3_G4D2N                3067
#define LC2G4D2N                      3068
#define LC2G4D2T                      3069
#define CLC2GLS3_G4D2T                3070
#define CLC2GLS3_G4D3N                3071
#define LC2G4D3N                      3072
#define CLC2GLS3_G4D3T                3073
#define LC2G4D3T                      3074
#define LC2G4D4N                      3075
#define CLC2GLS3_G4D4N                3076
#define CLC2GLS3_G4D4T                3077
#define LC2G4D4T                      3078
#define CLC3CON                       3079
#define LC3MODE                       3080
#define CLC3CON_MODE0                 3081
#define LC3MODE0                      3082
#define CLC3CON_MODE                  3083
#define CLC3CON_MODE1                 3084
#define LC3MODE1                      3085
#define CLC3CON_MODE2                 3086
#define LC3MODE2                      3087
#define LC3INTN                       3088
#define CLC3CON_INTN                  3089
#define LC3INTP                       3090
#define CLC3CON_INTP                  3091
#define LC3OUT                        3092
#define CLC3CON_OUT                   3093
#define LC3EN                         3094
#define CLC3CON_EN                    3095
#define CLC3POL                       3096
#define LC3G1POL                      3097
#define CLC3POL_G1POL                 3098
#define LC3G2POL                      3099
#define CLC3POL_G2POL                 3100
#define CLC3POL_G3POL                 3101
#define LC3G3POL                      3102
#define LC3G4POL                      3103
#define CLC3POL_G4POL                 3104
#define LC3POL                        3105
#define CLC3POL_POL                   3106
#define CLC3SEL0                      3107
#define CLC3SEL0_D1S0                 3108
#define LC3D1S0                       3109
#define LC3D1S                        3110
#define CLC3SEL0_D1S                  3111
#define LC3D1S1                       3112
#define CLC3SEL0_D1S1                 3113
#define LC3D1S2                       3114
#define CLC3SEL0_D1S2                 3115
#define LC3D1S3                       3116
#define CLC3SEL0_D1S3                 3117
#define LC3D1S4                       3118
#define CLC3SEL0_D1S4                 3119
#define CLC3SEL1                      3120
#define CLC3SEL1_D2S                  3121
#define CLC3SEL1_D2S0                 3122
#define LC3D2S                        3123
#define LC3D2S0                       3124
#define CLC3SEL1_D2S1                 3125
#define LC3D2S1                       3126
#define CLC3SEL1_D2S2                 3127
#define LC3D2S2                       3128
#define CLC3SEL1_D2S3                 3129
#define LC3D2S3                       3130
#define LC3D2S4                       3131
#define CLC3SEL1_D2S4                 3132
#define CLC3SEL2                      3133
#define CLC3SEL2_D3S0                 3134
#define LC3D3S                        3135
#define CLC3SEL2_D3S                  3136
#define LC3D3S0                       3137
#define LC3D3S1                       3138
#define CLC3SEL2_D3S1                 3139
#define LC3D3S2                       3140
#define CLC3SEL2_D3S2                 3141
#define LC3D3S3                       3142
#define CLC3SEL2_D3S3                 3143
#define LC3D3S4                       3144
#define CLC3SEL2_D3S4                 3145
#define CLC3SEL3                      3146
#define CLC3SEL3_D4S0                 3147
#define LC3D4S0                       3148
#define LC3D4S                        3149
#define CLC3SEL3_D4S                  3150
#define LC3D4S1                       3151
#define CLC3SEL3_D4S1                 3152
#define LC3D4S2                       3153
#define CLC3SEL3_D4S2                 3154
#define LC3D4S3                       3155
#define CLC3SEL3_D4S3                 3156
#define LC3D4S4                       3157
#define CLC3SEL3_D4S4                 3158
#define CLC3GLS0                      3159
#define CLC3GLS0_D1N                  3160
#define LC3G1D1N                      3161
#define LC3G1D1T                      3162
#define CLC3GLS0_D1T                  3163
#define LC3G1D2N                      3164
#define CLC3GLS0_D2N                  3165
#define CLC3GLS0_D2T                  3166
#define LC3G1D2T                      3167
#define CLC3GLS0_D3N                  3168
#define LC3G1D3N                      3169
#define LC3G1D3T                      3170
#define CLC3GLS0_D3T                  3171
#define CLC3GLS0_D4N                  3172
#define LC3G1D4N                      3173
#define CLC3GLS0_D4T                  3174
#define LC3G1D4T                      3175
#define CLC3GLS1                      3176
#define LC3G2D1N                      3177
#define CLC3GLS1_D1N                  3178
#define CLC3GLS1_D1T                  3179
#define LC3G2D1T                      3180
#define LC3G2D2N                      3181
#define CLC3GLS1_D2N                  3182
#define LC3G2D2T                      3183
#define CLC3GLS1_D2T                  3184
#define LC3G2D3N                      3185
#define CLC3GLS1_D3N                  3186
#define CLC3GLS1_D3T                  3187
#define LC3G2D3T                      3188
#define LC3G2D4N                      3189
#define CLC3GLS1_D4N                  3190
#define LC3G2D4T                      3191
#define CLC3GLS1_D4T                  3192
#define CLC3GLS2                      3193
#define LC3G3D1N                      3194
#define CLC3GLS2_D1N                  3195
#define LC3G3D1T                      3196
#define CLC3GLS2_D1T                  3197
#define CLC3GLS2_D2N                  3198
#define LC3G3D2N                      3199
#define CLC3GLS2_D2T                  3200
#define LC3G3D2T                      3201
#define CLC3GLS2_D3N                  3202
#define LC3G3D3N                      3203
#define LC3G3D3T                      3204
#define CLC3GLS2_D3T                  3205
#define CLC3GLS2_D4N                  3206
#define LC3G3D4N                      3207
#define CLC3GLS2_D4T                  3208
#define LC3G3D4T                      3209
#define CLC3GLS3                      3210
#define LC3G4D1N                      3211
#define CLC3GLS3_G4D1N                3212
#define LC3G4D1T                      3213
#define CLC3GLS3_G4D1T                3214
#define LC3G4D2N                      3215
#define CLC3GLS3_G4D2N                3216
#define CLC3GLS3_G4D2T                3217
#define LC3G4D2T                      3218
#define LC3G4D3N                      3219
#define CLC3GLS3_G4D3N                3220
#define CLC3GLS3_G4D3T                3221
#define LC3G4D3T                      3222
#define LC3G4D4N                      3223
#define CLC3GLS3_G4D4N                3224
#define LC3G4D4T                      3225
#define CLC3GLS3_G4D4T                3226
#define STATUS_SHAD                   3227
#define C_SHAD                        3228
#define DC_SHAD                       3229
#define Z_SHAD                        3230
#define WREG_SHAD                     3231
#define BSR_SHAD                      3232
#define PCLATH_SHAD                   3233
#define FSR0L_SHAD                    3234
#define FSR0H_SHAD                    3235
#define FSR1L_SHAD                    3236
#define FSR1H_SHAD                    3237
#define STKPTR                        3238
#define TOSL                          3239
#define TOSH                          3240

#endif // _PIC16LF1768_H_
